tutorials/Tjunction2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Get the kinematic pressure at the outlet
    #include "$FOAM_CASE/constant/inputParameters"

    inletVessel
    {
        type            zeroGradient;
    }
    
    outletVessel
    {
        
        type            fixedValue;
	    value           uniform $Pv0;
    }

    outletExt
    {
        type            fixedValue;
	    value           uniform $Pm0;
    }
    
    fixedWalls
    {
        type            zeroGradient;
    }
    
    injuryWalls
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
